app/services/authorize/token.rb

    def client_auth
      Client.find_by(api_key: api_key_to_string)
---
SELECT "clients".* FROM "clients" WHERE "clients"."api_key" = $1 LIMIT $2  [["api_key", "1235"], ["LIMIT", 1]]