app/services/migrate/data_migration.rb

    def migrate_org_to_db(org)
      Organisation.new(
        scheme_id: "#{org["scheme-id"]}",
        identifier_id: "#{org["identifier-id"]}",
        right_to_buy: Common::Helper.org_type_to_boolean("#{org["organisationType"]}"),
        domain_name: "#{org["domainName"]}",
        org_roles: Common::Helper.get_roles_from_list(org["orgRoles"]),
        cii_status: @cii_status_code,
        ppg_status: @ppg_org_status_code
      ).save

      return @org_list << {  organisation: "#{org["scheme-id"]}-#{org["identifier-id"]}", cii_org_status: @cii_status_code, ppg_org_status: @ppg_org_status_code, migrated_data: org  }
---
INSERT INTO "organisations" ("identifier_id", "org_roles", "right_to_buy", "scheme_id", "status", "status_description", "domain_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "org_id"

    def migrate_users_to_db(org)
      org["user"].each do |user|
        User.new(
          scheme_id: "#{org["scheme-id"]}",
          identifier_id: "#{org["identifier-id"]}",
          contact_email: "#{user["contactEmail"]}",
          contact_mobile: "#{user["contactMobile"]}",
          contact_phone: "#{user["contactPhone"]}",
          contact_fax: "#{user["contactFax"]}",
          contact_social: "#{user["contactSocial"]}",
          email: "#{user["email"]}",
          first_name: "#{user["firstName"]}",
          last_name: "#{user["lastName"]}",
          user_roles: Common::Helper.get_roles_from_list(user["userRoles"]),
          ppg_status: 123#@ppg_user_status_code
        ).save

        next @user_list << {  user: "#{user["email"]}", organisation: "#{org["scheme-id"]}-#{org["identifier-id"]}", ppg_user_status: 123, migrated_data: user  }#@ppg_user_status_code
---
INSERT INTO "users" ("contact_email", "contact_fax", "contact_mobile", "contact_phone", "contact_social", "email", "first_name", "last_name", "status", "status_description", "title", "user_roles", "identifier_id", "scheme_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "user_id"
INSERT INTO "users" ("contact_email", "contact_fax", "contact_mobile", "contact_phone", "contact_social", "email", "first_name", "last_name", "status", "status_description", "title", "user_roles", "identifier_id", "scheme_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "user_id"